#include "koep35shadowZone.h"

/*! Координаты области обзора в связанной СК */
const double cMaxY = 150.0; /*!< максимальный угол (градусы) обзора КОЭП по Y */
const double cMinY = -150.0; /*!< минимальный угол (градусы) обзора КОЭП по Y */

const double cMaxZ = 30.0; /*!< максимальный угол (градусы) обзора КОЭП по Z */
const double cMinZ = -50.0; /*!< минимальный угол (градусы) обзора КОЭП по Z */

const double c1degInRad = 1.0;
const double c5degInRad = 5.0;

/*! Массив опорных точек ограничения обзора КОЭП по углу места, значения в градусах, шаг по азимуту
 * 1 градус */
const double cZlimArrKoep[ HANG_POINT_SHADOW_ALL][ NODE_POINT_COUNT_KOEP] =
{
    /* 0 - конструкция самолета, [0; 150] */
    {
    /*    0,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10 */
       16.0, 16.2, 16.2, 16.4, 16.4, 16.6, 16.6, 16.6, 16.8, 16.8, 16.8,
    /*         11,   12,   13,   14,   15,   16,   17,   18,   19,   20 */
             16.8, 17.0, 17.0, 17.0, 23.6, 24.6, 25.6, 26.6, 27.6, 28.6,
    /*         21,   22,   23,   24,   25,   26,   27,   28,   29,   30 */
             29.6, 30.6, 31.4, 32.2, 33.2, 34.0, 34.8, 35.6, 36.2, 37.0,
    /*         31,   32,   33,   34,   35,   36,   37,   38,   39,   40 */
             37.6, 38.4, 39.0, 39.6, 40.4, 41.0, 41.4, 42.0, 42.6, 43.2,
    /*         41,   42,   43,   44,   45,   46,   47,   48,   49,   50 */
             43.6, 44.2, 44.6, 45.0, 45.6, 46.2, 46.4, 46.8, 47.2, 47.6,
    /*         51,   52,   53,   54,   55,   56,   57,   58,   59,   60 */
             48.0, 46.6, 46.2, 46.0, 46.0, 45.8, 45.6, 45.6, 45.4, 45.2,
    /*         61,   62,   63,   64,   65,   66,   67,   68,   69,   70 */
             45.0, 45.0, 44.8, 44.6, 44.4, 44.2, 43.8, 43.6, 43.4, 43.2,
    /*         71,   72,   73,   74,   75,   76,   77,   78,   79,   80 */
             42.8, 42.6, 42.4, 42.0, 41.6, 41.4, 41.0, 40.6, 40.4, 40.0,
    /*         81,   82,   83,   84,   85,   86,   87,   88,   89,   90 */
             39.6, 39.2, 38.8, 38.4, 37.8, 37.4, 37.0, 36.4, 36.0, 35.4,
    /*         91,   92,   93,   94,   95,   96,   97,   98,   99,  100 */
             35.0, 34.4, 33.8, 33.2, 32.6, 32.0, 31.4, 30.8, 30.2, 29.4,
    /*        101,  102,  103,  104,  105,  106,  107,  108,  109,  110 */
             28.8, 28.0, 27.4, 26.6, 25.8, 25.2, 24.4, 13.6, 22.8, 21.8,
    /*        111,  112,  113,  114,  115,  116,  117,  118,  119,  120 */
             21.0, 20.2, 19.2, 18.4, 17.4, 16.6, 15.6, 14.6, 11.6, 11.6,
    /*        121,  122,  123,  124,  125,  126,  127,  128,  129,  130 */
             11.6, 11.4, 11.4, 11.2, 11.2, 11.4, 11.4, 11.4, 11.4, 11.4,
    /*        131,  132,  133,  134,  135,  136,  137,  138,  139,  140 */
             11.4, 11.6, 11.8, 12.2, 12.6, 13.0, 13.4, 13.6, 13.0, 12.0,
    /*        141,  142,  143,  144,  145,  146,  147,  148,  149,  150 */
             12.2, 12.4, 12.4, 12.6, 12.8, 13.0, 13.2, 13.4, 13.6, 13.6
    },

    /* 1 - конструкция самолета, [ -150; 0] */
    {
    /* -150, -149, -148, -147, -146, -145, -144, -143, -142, -141 */
        1.6,  1.4,  1.0,  0.8,  2.6,  3.2,  3.6,  3.8,  4.0,  5.0,
    /* -140, -139, -138, -137, -136, -135, -134, -133, -132, -131 */
        5.2,  5.2,  5.4,  5.2,  5.2,  5.2,  5.0,  4.2,  4.2,  4.2,
    /* -130, -129, -128, -127, -126, -125, -124, -123, -122, -121 */
        4.2,  4.2,  4.2,  3.0,  3.0,  4.2,  4.4,  4.4,  4.4,  4.4,
    /* -120, -119, -118, -117, -116, -115, -114, -113, -112, -111 */
        4.4,  4.4,  4.4,  4.4,  4.4,  4.4,  4.4,  4.4,  4.4,  4.4,
    /* -110, -109, -108, -107, -106, -105, -104, -103, -102, -101 */
        4.4,  4.4,  4.2,  4.2,  4.2,  3.2,  2.6,  2.6,  4.2,  4.2,
    /* -100,  -99,  -98,  -97,  -96,  -95,  -94,  -93,  -92,  -91 */
        4.2,  4.2,  4.0,  4.0,  4.0,  4.0,  4.0,  4.0,  7.0,  7.0,
    /*  -90,  -89,  -88,  -87,  -86,  -85,  -84,  -83,  -82,  -81 */
        7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,
    /*  -80,  -79,  -78,  -77,  -76,  -75,  -74,  -73,  -72,  -71 */
        7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  7.0,  6.8,
    /*  -70,  -69,  -68,  -67,  -66,  -65,  -64,  -63,  -62,  -61 */
        6.8,  6.8,  6.8,  6.8,  6.8,  6.8,  6.8,  6.8,  7.0,  7.0,
    /*  -60,  -59,  -58,  -57,  -56,  -55,  -54,  -53,  -52,  -51 */
        7.2,  7.4,  7.6,  7.8,  8.2,  8.4,  8.8, 14.0, 14.6, 15.0,
    /*  -50,  -49,  -48,  -47,  -46,  -45,  -44,  -43,  -42,  -41 */
       15.2, 15.6, 16.0, 16.2, 16.6, 16.8, 17.2, 17.4, 17.8, 18.0,
    /*  -40,  -39,  -38,  -37,  -36,  -35,  -34,  -33,  -32,  -31 */
       18.2, 18.6, 18.8, 19.0, 19.2, 19.0, 18.6, 18.4, 18.0, 17.6,
    /*  -30,  -29,  -28,  -27,  -26,  -25,  -24,  -23,  -22,  -21 */
       17.2, 16.8, 16.4, 15.8, 15.2, 14.8, 14.4, 14.0, 13.6, 13.4,
    /*  -20,  -19,  -18,  -17,  -16,  -15,  -14,  -13,  -12,  -11 */
       13.4, 13.0, 12.4, 12.0, 11.6, 10.8,  9.8,  8.8,  8.0,  7.0,
    /*  -10,   -9,   -8,   -7,   -6,   -5,   -4,   -3,   -2,   -1,    0 */
        6.2,  5.6,  5.0,  4.8,  4.8,  5.2,  6.4, 11.8, 13.8, 15.8, 16.0
    },

    /* 2 - ТП4 РВВ, [0; 150] */
    {
    /*    0,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10 */
       50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         11,   12,   13,   14,   15,   16,   17,   18,   19,   20 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         21,   22,   23,   24,   25,   26,   27,   28,   29,   30 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         31,   32,   33,   34,   35,   36,   37,   38,   39,   40 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         41,   42,   43,   44,   45,   46,   47,   48,   49,   50 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         51,   52,   53,   54,   55,   56,   57,   58,   59,   60 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         61,   62,   63,   64,   65,   66,   67,   68,   69,   70 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*         71,   72,   73,   74,   75,   76,   77,   78,   79,   80 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 15.6, 15.4, 15.2,
    /*         81,   82,   83,   84,   85,   86,   87,   88,   89,   90 */
             15.0, 14.8, 14.8, 14.8, 14.8, 14.8, 14.8, 14.8, 14.4, 14.0,
    /*         91,   92,   93,   94,   95,   96,   97,   98,   99,  100 */
             13.6, 13.6, 13.6, 13.6, 14.0, 14.6, 14.6, 14.6, 14.6, 14.4,
    /*        101,  102,  103,  104,  105,  106,  107,  108,  109,  110 */
             10.2, 10.0, 10.0,  9.8,  9.6,  9.4, 11.8, 11.8, 11.6, 50.0,
    /*        111,  112,  113,  114,  115,  116,  117,  118,  119,  120 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0,
    /*        121,  122,  123,  124,  125,  126,  127,  128,  129,  130 */
             50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 11.4, 11.2, 11.0, 10.0,
    /*        131,  132,  133,  134,  135,  136,  137,  138,  139,  140 */
              9.6,  9.0,  8.6,  8.0,  7.8,  7.6,  7.6,  8.8,  8.6,  8.4,
    /*        141,  142,  143,  144,  145,  146,  147,  148,  149,  150 */
              8.2, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0, 50.0
    },

    /* ТП12 КАБ, РВП, РВВ БД, [0; 150] */
    {
    /*     0,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10 */
        16.0, 16.0, 16.2, 16.2, 16.4, 16.4, 16.6, 16.6, 16.6, 16.8, 16.8,
    /*          11,   12,   13,   14,   15,   16,   17,   18,   19,   20 */
              16.8, 17.0, 17.0, 17.0, 17.0, 23.8, 24.8, 25.8, 26.8, 27.8,
    /*          21,   22,   23,   24,   25,   26,   27,   28,   29,   30 */
              28.8, 29.8, 30.6, 31.6, 32.4, 33.2, 34.0, 34.8, 35.6, 36.4,
    /*          31,   32,   33,   34,   35,   36,   37,   38,   39,   40 */
              37.2, 37.8, 38.6, 39.2, 39.8, 40.4, 41.0, 41.6, 42.2, 42.8,
    /*          41,   42,   43,   44,   45,   46,   47,   48,   49,   50 */
              43.2, 43.8, 44.2, 44.8, 45.2, 45.6, 46.0, 46.4, 46.8, 47.2,
    /*          51,   52,   53,   54,   55,   56,   57,   58,   59,   60 */
              47.6, 46.4, 46.2, 18.6, 18.4, 18.2, 18.0, 17.8, 17.8, 17.6,
    /*          61,   62,   63,   64,   65,   66,   67,   68,   69,   70 */
              17.4, 17.2, 17.0, 16.8, 16.6, 16.4, 16.2, 16.0, 15.8, 15.6,
    /*          71,   72,   73,   74,   75,   76,   77,   78,   79,   80 */
              15.2, 15.0, 14.8, 14.6, 14.2, 14.0, 14.0, 14.0, 13.8, 13.8,
    /*          81,   82,   83,   84,   85,   86,   87,   88,   89,   90 */
              13.8, 13.6, 13.6, 13.6, 13.4, 13.4, 13.2, 13.2, 13.0, 12.8,
    /*          91,   92,   93,   94,   95,   96,   97,   98,   99,  100 */
              12.8, 12.6, 12.6, 12.4, 12.2, 12.2, 12.0, 11.8, 11.8, 11.6,
    /*         101,  102,  103,  104,  105,  106,  107,  108,  109,  110 */
              11.4, 11.2, 11.2, 11.0, 10.8, 10.6, 10.4, 10.2, 10.0, 10.0,
    /*         111,  112,  113,  114,  115,  116,  117,  118,  119,  120 */
               9.8,  9.6,  9.4,  9.2,  9.0,  8.8,  8.6,  8.4,  8.2,  8.0,
    /*         121,  122,  123,  124,  125,  126,  127,  128,  129,  130 */
               7.8,  7.4,  7.2,  7.0,  6.8,  6.6,  6.4,  6.2,  6.0,  6.0,
    /*         131,  132,  133,  134,  135,  136,  137,  138,  139,  140 */
               5.8,  5.8,  5.6,  5.6,  5.4,  5.4,  5.4,  5.4,  5.6,  5.6,
    /*         141,  142,  143,  144,  145,  146,  147,  148,  149,  150 */
               5.6,  5.6,  5.6,  5.6,  5.8,  5.8,  5.8,  5.8,  5.8,  5.8
    },

    /* ТП9 КАБ, РВП, РВВ БД, [ -150; 0] */
    {
    /*   -150,  -149,  -148,  -147,  -146,  -145,  -144,  -143,  -142,  -141 */
          1.4,   1.0,   0.8,   0.8,   2.6,   3.2,   3.6,   1.4,  -9.2, -10.6,
    /*   -140,  -139,  -138,  -137,  -136,  -135,  -134,  -133,  -132,  -131 */
        -11.0, -11.4, -11.6, -11.8, -12.2, -12.4, -12.6, -12.8, -13.0, -13.2,
    /*   -130,  -129,  -128,  -127,  -126,  -125,  -124,  -123,  -122,  -121 */
        -13.4, -13.6, -13.8, -14.0, -14.0, -14.2, -14.4, -14.6, -14.8, -14.8,
    /*   -120,  -119,  -118,  -117,  -116,  -115,  -114,  -113,  -112,  -111 */
        -15.0, -15.2, -15.4, -15.4, -15.6, -15.6, -15.8, -16.0, -16.0, -16.0,
    /*   -110,  -109,  -108,  -107,  -106,  -105,  -104,  -103,  -102,  -101 */
        -16.0, -16.2, -16.2, -16.2, -16.2, -16.2, -16.4, -16.4, -16.4, -16.4,
    /*   -100,   -99,   -98,   -97,   -96,   -95,   -94,   -93,   -92,   -91 */
        -16.4, -16.4, -16.4, -16.4, -16.4, -16.4, -16.2, -16.2, -16.1, -16.2,
    /*    -90,   -89,   -88,   -87,   -86,   -85,   -84,   -83,   -82,   -81 */
        -16.2, -16.2, -16.0, -16.0, -16.0, -15.8, -15.8, -15.8, -15.6, -15.6,
    /*    -80,   -79,   -78,   -77,   -76,   -75,   -74,   -73,   -72,   -71 */
        -15.6, -15.4, -15.4, -15.2, -15.0, -14.8, -14.6, -14.4, -14.2, -14.0,
    /*    -70,   -69,   -68,   -67,   -66,   -65,   -64,   -63,   -62,   -61 */
        -14.0, -13.6, -13.4, -13.2, -13.0, -12.8, -12.6, -12.4, -12.2, -12.0,
    /*    -60,   -59,   -58,   -57,   -56,   -55,   -54,   -53,   -52,   -51 */
        -11.6, -11.4, -11.2, -11.0, -10.6, -10.4, -10.2,  -9.8,  -9.6,  -9.4,
    /*    -50,   -49,   -48,   -47,   -46,   -45,   -44,   -43,   -42,   -41 */
         -9.0,  -8.8,  -8.4,  -8.0,  -7.6,  -7.0,  -6.2,  17.4,  17.8,  18.0,
    /*    -40,   -39,   -38,   -37,   -36,   -35,   -34,   -33,   -32,   -31 */
         18.2,  18.6,  18.8,  19.0,  19.0,  18.8,  18.4,  18.0,  17.6,  17.4,
    /*    -30,   -29,   -28,   -27,   -26,   -25,   -24,   -23,   -22,   -21 */
         17.0,  16.4,  15.8,  15.4,  14.8,  14.4,  14.0,  13.8,  13.6,  13.4,
    /*    -20,   -19,   -18,   -17,   -16,   -15,   -14,   -13,   -12,   -11 */
         13.0,  12.6,  12.2,  11.8,  11.2,  10.0,   9.0,   8.2,   7.2,   6.4,
    /*    -10,    -9,    -8,    -7,    -6,    -5,    -4,    -3,    -2,    -1,    0 */
          5.8,   5.2,   4.8,   4.8,   4.8,   5.2,   6.2,  11.6,  13.6,  15.6, 16.0
    }
};

/*! Преобразование типы формы тени из перечисления в индекс в массиве данных
 **************************************************************************************************/
int enumValToIndex(
    const ThangPointShadow hps /*!< тип формы тени */
) {
    int result = 0;

    if( PLANE_SHAPE_Y_POS == hps)
    {
        result = 0;
    }
    else if( PLANE_SHAPE_Y_NEG == hps)
    {
        result = 1;
    }
    else if( TP1_RVV == hps)
    {
        result = 2;
    }
    else if( TP1_KAB_RVP_RVV_BD == hps)
    {
        result = 3;
    }
    else if( TP1_KAB_RVP_RVV_BD == hps)
    {
        result = 4;
    }
    else if( TP4_RVV == hps)
    {
        result = 5;
    }
    else if( TP4_UNCONTROL_AB_NAR == hps)
    {
        result = 6;
    }
    else if( TP6_RVV == hps)
    {
        result = 7;
    }
    else if( TP8_RVV == hps)
    {
        result = 8;
    }
    else if( TP8_L265M10 == hps)
    {
        result = 9;
    }
    else if( TP9_RVV == hps)
    {
        result = 10;
    }
    else if( TP9_KAB_RVP_RVV_BD == hps)
    {
        result = 11;
    }
    else if( TP9_UNCONTROL_AB == hps)
    {
        result = 12;
    }
    else if( TP12_RVV == hps)
    {
        result = 13;
    }
    else if( TP12_KAB_RVP_RVV_BD == hps)
    {
        result = 14;
    }
    else if( TP12_UNCONTROL_AB_NAR == hps)
    {
        result = 15;
    }

    return result;
}


/*! Подготовка знаменателя к делению, проверка на равенство нулю
 **************************************************************************************************/
double zeroSafeDenom(
    const double denom /*!< знаменатель */
) {
    return ( fabs( denom) > F_NULL) ? denom : F_NULL;
}

/*! Опредение минимального элемента массива
 **************************************************************************************************/
double minVal(
    const double *arr, /*!< указатель на начало массива */
    const int count /*!< количество элементов в массиве */
) {
    double result = 0.0;

    if( arr)
    {
        int i;
        result = arr[ 0];
        for( i = 0; i < count; ++i)
        {
            if( result > arr[ i])
            {
                result = arr[ i];
            }
        }
    }

    return result;
}

///*! Линейная интерполяция табличного значения с контролем границ значений.
// *  Таблица задана двумя массивами (аргумента и функции)
// **************************************************************************************************/
//double arrValLinearInterpol(
//    const double argVal, /*!< Аргумент точки переменной */
//    const double* argArr, /*!< Массив значений аргумента */
//    const double* resArr, /*!< Массив значений функции */
//    const int size /*!< Размер массивов */
//) {
//    double result = 0.0;

//    if( argVal < argArr[ 0])
//    {
//        result = resArr[ 0];
//    }
//    else if( argVal >= argArr[ size - 1])
//    {
//        result = resArr[ size - 1];
//    }

//    int i;
//    for( i = 0; i < size - 1; ++i)
//    {
//        if( argVal == argArr[ i])
//        {
//            result = resArr[ i];
//        }

//        if( ( argVal > argArr[i]) && ( argVal < argArr[ i + 1]))
//        {
//            /* Формула линейной интерполяции */
//            result =  ( resArr[ i + 1] - resArr[ i]) * ( argVal - argArr[ i]) /
//                zeroSafeDenom( argArr[ i + 1] - argArr[ i]) + resArr[ i];
//        }
//    }

//    return result;
//}

/*! Функция ограничения углов обзора КОЭП
 * Значения углов в радианах
 **************************************************************************************************/
void koep35checkVisionAngles(
    const ThangPointShadow hangPointShadow, /*!< тип тени на подвеске */
    double *Y, /*!< азимут в ССК */
    double *Z, /*!< угол места в ССК */
    char *limY, /*!< 0 - допустимое значение по Y, 1 - недопустимое значение по Y */
    char *limZ, /*!< 0 - допустимое значение по Z, 1 - недопустимое значение по Z */
    char *shadow1deg, /*!< признак затенения 1 град. */
    char *shadow5deg  /*!< признак затенения 5 град. */
) {
    /* Локальные копии входных параметров */
    char limYlocal = 0, limZlocal = 0;
    char shadow1degLocal = 0, shadow5degLocal = 0;
    double yLocal = ( *Y) * RadToGr, zLocal = ( *Z) * RadToGr;

    char hangPointEvenFlag = hangPointShadow % 2; /* флаг четности номера подвески */

    /* Определение минимального и максимального азимутов в зависимости от четности подвески */
    double actualMinY = ( hangPointEvenFlag) ? cMinY : 0.0;
    double actualMaxY = ( hangPointEvenFlag) ? 0.0 : cMaxY;

    // Проверка углов на функциональные ограничения обзора КОЭП
    if( yLocal < actualMinY)
    {
        limYlocal = 1;
        yLocal = actualMinY;
    }
    else if( yLocal >= actualMaxY)
    {
        limYlocal = 1;
        yLocal = actualMaxY;
    }

    if( zLocal <= cMinZ)
    {
        limZlocal = 1;
        zLocal = cMinZ;
    }
    else
    {
        double yValArr[ NODE_POINT_COUNT_KOEP];

        int i;
        if( hangPointEvenFlag)
        {
            /* Нечетные подвески */
            for( i = 0; i < NODE_POINT_COUNT_KOEP; ++i)
            {
                yValArr[ i] = ( double)i - 150.0;
            }
        }
        else
        {
            /* Четные подвески */
            for( i = 0; i < NODE_POINT_COUNT_KOEP; ++i)
            {
                yValArr[ i] = ( double)i;
            }
        }

        /* Нахождение индекса целого значения азимута (  аргумента), начиная с которого будет
         * осуществляться линейная интерполяция */
        int iYvalWholePart = 150;
        for( i = 0; i < NODE_POINT_COUNT_KOEP - 1; ++i)
        {
            if( ( yValArr[ i] >= yLocal) && ( yLocal < yValArr[ i + 1]))
            {
                iYvalWholePart = i;
                break;
            }
        }

        int iCurrShape = enumValToIndex( hangPointShadow); /* индекс текущей формы тени в массиве */

        /* Формула линейной интерполяции на найденном участке */
        double limitZ;
        if( 150 != iYvalWholePart)
        {
            double currZarr[ 2][ 2]; /* массивы текущих значений угла места для вычислений */
            currZarr[ 0][ 0] = cZlimArrKoep[ iCurrShape][ iYvalWholePart + 1];
            currZarr[ 1][ 0] = cZlimArrKoep[ iCurrShape][ iYvalWholePart];

            ThangPointShadow currPlaneSide = ( hangPointEvenFlag) ? PLANE_SHAPE_Y_NEG
                : PLANE_SHAPE_Y_POS; /* текущая сторона силуэта самолета, левая или правая */
            currZarr[ 0][ 1] = cZlimArrKoep[ currPlaneSide][ iYvalWholePart + 1];
            currZarr[ 1][ 1] = cZlimArrKoep[ currPlaneSide][ iYvalWholePart];

            limitZ = ( minVal( currZarr[ 0], 2) - minVal( currZarr[ 1], 2))
                * ( yLocal - yValArr[ iYvalWholePart]) + cZlimArrKoep[ iCurrShape][ iYvalWholePart];
        }
        else
        {
            limitZ = cZlimArrKoep[ iCurrShape][ 150];
        }

//        double limitZ = arrValLinearInterpol( yLocal, yValArr, cZlimArrKoep[ iCurrShape],
//            NODE_POINT_COUNT_KOEP);

        if( zLocal >= limitZ)
        {
            limZlocal = 1;
            shadow1degLocal = 1;
            shadow5degLocal = 1;
            zLocal = limitZ;
        }
        else if( zLocal >= limitZ + c1degInRad)
        {
            shadow1degLocal = 1;
            shadow5degLocal = 1;
        }
        else if( zLocal >= limitZ + c5degInRad)
        {
            shadow5degLocal = 1;
        }
    }

    *Y = yLocal * GrToRad;
    *Z = zLocal * GrToRad;
    *limY = limYlocal;
    *limZ = limZlocal;
    *shadow1deg = shadow1degLocal;
    *shadow5deg = shadow5degLocal;
}
