/********************************** ukbo42 *************************************
 ** ОРГАНИЗАЦИЯ:     ОАО "РПКБ"
 ** СОЗДАН:          28 августа 2017 г. APasternak
 ** ИЗМЕНЕН:         28 августа 2017 г. APasternak
 *******************************************************************************
 ** ПЕРЕЧЕНЬ ИЗМЕНЕНИЙ:
 ** 28 августа 2017 г. APasternak. Суть внесенных изменений
 *******************************************************************************
 */
/*!
 ** \file  oop_math_include.h
 ** \brief Краткий комментарий к файлу
 **      Мастер-файл заголовочников и констант ООП математической библиотеки
 ** Расширенный комментарий к файлу
 */

#ifndef OOP_MATH_INCLUDE_H_
#define OOP_MATH_INCLUDE_H_

#include <stdint.h>

#include "scalar.h"
#include "vect2rd.h"
#include "vect3rd.h"
#include "matr3x3.h"

#ifndef F_NULL
#define F_NULL 1e-20
#endif

#define ADV_MATH_LIB 1 /* Параметризованная математическая библиотека */

#endif /* OOP_MATH_INCLUDE_H_ */
